# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# N=int(input("Введите количество элементов в массиве: "))
# List=[]
# print("Введите значения списка")
# List = [int(input()) for i in range(N)]
# count = 0
# print(List)
# k=int(input("Число, количество повторений которого мы хотим узнать: "))
# for item in List:
#     if item == k:
#         count+=1
# print(count)



# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# N=int(input("Введите количество элементов в массиве: "))
# List=[]
# print("Введите значения списка")
# List = [int(input()) for i in range(N)]

# k=int(input("Число, ближайшее к которому мы хотим узнать: "))
# for item in List:
#     min=abs(List[0]-k)
#     if abs(item-k)<=min:
#         res=item
# print(res)    

