# Задача 26: Напишите программу, которая на вход принимает
# два числа A и B, и возводит число А в целую степень B с
# помощью рекурсии.

# import Funcs

# a=float(input("Введите число: "))
# b=float(input("Введите степень: "))

# print(Funcs.degree(a,b))



# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.

# import Funcs
# a=int(input("Введите первое число:"))
# b=int(input("Введите второе число:"))

# print(Funcs.sum(a,b))