# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a
# n = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# n=int(input("Введите длину : "))
# d=int(input("Введите шаг прогрессии: "))
# a1=int(input("Введите первый шаг прогрессии: "))
# list1=[]
# for i in range(a1,a1+(n-1)*d+1,d):
#     list1.append(i)
# print(list1)

# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

# list1=[-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# list2=[]
# max=int(input("Введите верхнюю границу диапазона: "))
# min=int(input("Введите нижнюю границу диапазона: "))
# for i in list1:
#     if i <= max and i >= min:
#        list2.append(list1.index(i))
# print(list2)

