# Задача №1.
# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.

# n=int(input("Введите расстояние, которое проходит авто за день: "))
# m=int(input("Введите общий пробег : "))

# res=(m+n-1)//n
# print (res)


# Задача №3.
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.

# a=int(input('Количество учеников в первом классе: '))
# b=int(input('Количество учеников во втором классе: '))
# c=int(input('Количество учеников в третьем классе: '))

# n=2

# res =(a+n-1)//n+(b+n-1)//n +(c+n-1)//n

# print(res)